<template>
  <div class="container py-5">
    <section id="about">
      <h2 class="h4 mb-4 text-center text-wrap">Веб-интерфейс для фильтрации изображений (Вариант 3)</h2>
      <div class="small text-center mb-1 fw-bold text-wrap">
        <p>Цель: Разработать веб-приложение для применения базовых фильтров
          компьютерного зрения (фильтры сглаживания/размытия, градиентные фильтры, фильтры
          размытия границ, фильтры для улучшения контраста и деталей).</p>
        <p>Описание: Загрузка изображения на сервер, применение фильтров (размытие,
          детекция краев, пороговая обработка) с помощью OpenCV, сохранение результата в БД
          (связь исходное-обработанное) и отдача пользователю.</p>
      </div>
    </section>
  </div>
</template>